package com.example.jeomjamoon;

public class QuestionAnswer {

    public static String question[] = { // 문제 (점자 txt로 넣기) -> 이거 다시 확인, MainActivity.java 연결 다시 확인
            "⠼⠙",
            "⠼⠋⠛",
            "⠈⠎⠘⠍⠁⠕",
            "⠑⠯⠈⠥⠈⠕",
            "⠠⠷⠠⠍⠈⠾",
            "⠰⠥⠐⠭",
            "⠚⠉⠮",
            "⠈⠥⠈⠍⠑",
            "⠣⠐⠗",
            "⠥⠉⠮",
            "⠫⠢⠇⠚⠃⠉⠕⠊",
            "⠰⠍⠁⠚⠚⠃⠉⠕⠊",
            "⠠⠕⠂⠴⠠⠪⠃⠉⠕⠊",
            "⠘⠕⠐⠕⠊",
            "⠥⠊",
            "⠰⠎⠪⠢⠀⠘⠽⠃⠈⠝⠌⠠⠪⠃⠉⠕⠊",
            "⠉⠗⠕⠂⠵⠀⠕⠂⠬⠕⠂⠕⠃⠉⠕⠊",
            "⠈⠪⠉⠵⠀⠑⠱⠆⠀⠇⠂⠕⠃⠉⠕⠠⠈⠣⠦",
            "⠋⠎⠙⠕⠫⠀⠉⠎⠑⠍⠀⠠⠕⠶⠈⠎⠃⠠⠪⠃⠉⠕⠊",
            "⠰⠍⠛⠊⠝⠀⠰⠣⠶⠑⠛⠮⠀⠊⠔⠣⠨⠍⠠⠝⠬"
            // R.drawable.beautifulindonesia1, R.drawable.beautifulindonesia2, R.drawable.beautifulindonesia3, R.drawable.beautifulindonesia4, R.drawable.beautifulindonesia5
    };
    public static String choices[][] = { // 선택지
            {"1", "4", "7", "9"},
            {"23", "38", "45", "67"},
            {"토끼", "거북이", "고양이", "강아지"},
            {"물고기", "코끼리", "부엉이", "개구리"},
            {"손수건", "키보드", "주사위", "라디오"},
            {"빨강", "노랑", "초록", "보라"},
            {"공원", "바다", "구름", "하늘"},
            {"핫도그", "바나나", "고구마", "오징어"},
            {"위", "아래", "왼쪽", "오른쪽"},
            {"오늘", "내일", "어제", "모레"},
            {"안녕하세요", "반갑습니다", "다녀오겠습니다", "감사합니다"},
            {"고맙습니다", "부탁합니다", "축하합니다", "최고입니다"},
            {"좋습니다", "싫습니다", "힘듭니다", "피곤합니다"},
            {"짜다", "싱겁다", "달콤하다", "비리다"},
            {"가다", "오다", "내리다", "오르다"},
            {"만나서 반갑습니다", "처음 뵙겠습니다", "생일 축하합니다", "기분이 좋습니다"},
            {"내일은 일요일입니다", "오늘은 화요일입니다", "어제는 금요일입니다", "어제는 월요일입니다"},
            {"그는 누구입니까?", "그는 몇 살입니까?", "그는 어디에서 왔습니까?", "그는 어디에 있습니까?"},
            {"시간이 다 지났습니다", "요리가 정말 맛있습니다", "날씨가 아주 흐립니다", "커피가 너무 싱겁습니다"},
            {"추운데 창문을 닫아주세요", "다시 말씀 해주세요", "그녀는 갈색 코트를 입었어요", "미로에서 길을 잃었어요"}
    };

    public static String correctAnswers[] = { // 정답
            "4",
            "67",
            "거북이",
            "물고기",
            "손수건",
            "초록",
            "하늘",
            "고구마",
            "아래",
            "오늘",
            "감사합니다",
            "축하합니다",
            "싫습니다",
            "비리다",
            "오다",
            "처음 뵙겠습니다",
            "내일은 일요일입니다",
            "그는 몇 살입니까?",
            "커피가 너무 싱겁습니다",
            "추운데 창문을 닫아주세요"
    };
}
